IDEA Connection Link
WizardSelection Class
 WizardSelection
Inheritance Hierarchy
System.Object
 IdeaRS.ConnectionLink.WizardSelection
 Namespace: IdeaRS.ConnectionLink
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
[SerializableAttribute]
public class WizardSelection
<SerializableAttribute>
Public Class WizardSelection
[SerializableAttribute]
public ref class WizardSelection
The WizardSelection type exposes the following members.
Constructors
Name | Description
WizardSelection
 Constructor
Top
Properties
Name | Description
CombiInput
 List of Combinations
LoadCase
 List of LoadCases
LoadGroup
 List of Load groups
Top
Methods
Name | Description
Equals
Determines whether the specified object is equal to the current object.
 (Inherited from Object.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetHashCode
Serves as the default hash function.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
See Also
Reference
IdeaRS.ConnectionLink Namespace